Revit 2027 API
HVACLoadType.AreaPerPerson Property
 The area per person.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AreaPerPerson { get; set; }
Public Property AreaPerPerson As Double
	Get
	Set
public:
property double AreaPerPerson {
	double get ();
	void set (double value);
}
member AreaPerPerson : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for value must be non-negative.
See Also
Reference
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace